request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
        <soapenv:Body>
            <tem:ProductTypeInquiry>
                <!--Optional:-->
                <tem:RequestNo></tem:RequestNo>
                <!--Optional:-->
                <tem:AgentCode>OMSINMYMO</tem:AgentCode>
                <!--Optional:-->
                <tem:AgentPassword>!qaz@wsx</tem:AgentPassword>
                <!--Optional:-->
                <tem:Language>TH</tem:Language>
                <!--Optional:-->
                <tem:InsurerId></tem:InsurerId>
            </tem:ProductTypeInquiry>
        </soapenv:Body>
</soapenv:Envelope>